src/config/Documents/а_Маршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>а_Маршруты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.а_ДатаВывозаФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.а_Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.а_Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПунктыРазгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктРазгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПунктыРазгрузки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Авто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прицеп</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Прицепы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОбработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/InformationRegisters/а_ДатаВывозаФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>а_ДатаВывозаФакт</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Авто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Авто</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прицепы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/а_СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>а_СтатусыЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.а_ТипыСтатусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/а_ЗаявкиКВывозу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>а_ЗаявкиКВывозу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/а_ТипыСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>а_ТипыСтатусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтатусСобрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусВывоза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/а_Маршруты/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	//Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
	//	И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
	//	ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	//КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регістр а_ДатаВывозаФакт
	Движения.а_ДатаВывозаФакт.Записывать = Истина;
	Для Каждого ТекСтрокаПунктыРазгрузки Из ПунктыРазгрузки Цикл
		Движение = Движения.а_ДатаВывозаФакт.Добавить();
		Движение.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
		Движение.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
		Движение.ДатаОтгрузки = ТекСтрокаПунктыРазгрузки.ДатаОтгрузки;
		Движение.Водитель = ТекСтрокаПунктыРазгрузки.Водитель;
		Движение.Авто = ТекСтрокаПунктыРазгрузки.Авто;
		Движение.Прицеп = ТекСтрокаПунктыРазгрузки.Прицеп;
		Движение.Перевозчик = ТекСтрокаПунктыРазгрузки.Перевозчик;
		
		Если ТекСтрокаПунктыРазгрузки.СтатусОбработан Тогда
			Менеджер = РегистрыСведений.а_СтатусыЗаявок.СоздатьМенеджерЗаписи();
			Менеджер.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
			Менеджер.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
			Менеджер.ТипСтатуса = Перечисления.а_ТипыСтатусов.СтатусВывоза;
			Менеджер.СтатусОбработан = Истина;
			Попытка
				Менеджер.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого ТекСтрокаПунктыРазгрузки Из ПунктыРазгрузки Цикл
		Менеджер = РегистрыСведений.а_СтатусыЗаявок.СоздатьМенеджерЗаписи();
		Менеджер.Объект = ТекСтрокаПунктыРазгрузки.Заявка;
		Менеджер.Идентификатор = ТекСтрокаПунктыРазгрузки.Идентификатор;
		Менеджер.ТипСтатуса = Перечисления.а_ТипыСтатусов.СтатусВывоза;
		Менеджер.СтатусОбработан = Ложь;
		Попытка
			Менеджер.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры


Процедура ЗаполнитьМаршруты() Экспорт
	
	Если Не ЗначениеЗаполнено(ПериодОтгрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Период отгрузки не заполнен - будет заполнено за все периоды.'; uk = 'Період відвантаження не заповнено - буде заповнено по всіх періодах.'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Регион) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Регион не заполнен. Будет заполнено по всем регионам.'; uk = 'Регіон не заповнено. Буде заповнено по всіх регіонах.'"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодОтгрузки", ПериодОтгрузки);
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Заявка,
	               |	Заявка.НомерСтроки КАК НомерСтроки,
	               |	Заявка.ПунктРазгрузки КАК ПунктРазгрузки,
	               |	Заявка.Контрагент КАК Контрагент,
	               |	Заявка.Договор КАК Договор,
	               |	Заявка.Идентификатор КАК Идентификатор,
	               |	Заявка.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	Заявка.Количество КАК Количество,
	               |	Заявка.Организация КАК Организация,
	               |	Заявка.Водитель КАК Водитель,
	               |	Заявка.Авто КАК Авто,
	               |	Заявка.Прицеп КАК Прицеп,
	               |	Заявка.Перевозчик КАК Перевозчик,
	               |	Заявка.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	Заявка.КонтактныеДанные КАК КонтактныеДанные,
	               |	Заявка.Склад КАК Склад,
	               |	Заявка.Обработано КАК Обработано,
	               |	Заявка.Статус КАК Статус,
	               |	Заявка.Регион КАК Регион,
	               |	Заявка.СтадияОбработан КАК СтадияОбработан,
	               |	Заявка.СтадияПечатьСклад КАК СтадияПечатьСклад,
	               |	Заявка.СтадияГотовыеДокументы КАК СтадияГотовыеДокументы,
	               |	Заявка.СтадияВыполнена КАК СтадияВыполнена,
	               |	Заявка.Стадия5 КАК Стадия5,
	               |	Заявка.Стадия6 КАК Стадия6,
	               |	Заявка.ЗаказНаЗборку КАК ЗаказНаЗборку
	               |ИЗ
	               |	Документ.ерпсЗаявкаНаСозданиеАктовПриемкиПередачи.ПунктыРазгрузки КАК Заявка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.а_ЗаявкиКВывозу КАК ЗаявкиКВывозу
	               |		ПО Заявка.Ссылка = ЗаявкиКВывозу.Объект
	               |ГДЕ
	               |	Заявка.Ссылка.ПериодОтгрузки = &ПериодОтгрузки
	               |	И Заявка.Регион = &Регион
	               |	И Заявка.Организация = &Организация";
	
	ПунктыРазгрузки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
